/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   tokenizer.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jiyunpar <jiyunpar@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/03 13:36:05 by jiyunpar          #+#    #+#             */
/*   Updated: 2022/11/03 14:00:15 by jiyunpar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

1. 토큰에 담을 때 풀어서 담는다.
2. 실행할 때 풀어서 실행한다.
3. 트리에 매달 때 풀어서 매단다.

1. token화
- 딱 정말 토근 단위로 끊기
- 토큰화가 되는지 확인하기 (이 때?)
- list 만들어짐
2. list를 순회하면서 expand하기
3. expand된 list값으로 tree 만들기
(순회는 2번)

규칙
1. 입력의 끝이 있으면 현재 판단중인 문자열을 토큰으로 본다

2. 이전 문자가 operator의 일부이면서 현재 문자가 따옴표가 아니고 
	이전문자와 연결해서 operator 취급이 되면 operator의 일부임.
	
3. 이전 문자가 operator의 일부고, 
	현재 문자가 이전이랑 연관해서 operator가 안되면 이전 문자까지가 operator로 토큰화됨
	
4. " 시작이면, 끝나는 따옴표가 나오기 전까지 문자들을 문자 그대로 인식한다.

5. 현재 문자가 "로 묶이지 않은 '$' 인 경우
 
6. 현재 문자가 " 안에 없고, operator의 시작이 될 수 있으면 토큰화한다.

7. 공백을 만나면 지금까지 넣은 것을 토큰화 한다. 공백은 무시한다.

8. 전 문자가 단어의 일부라면 현 문자도 단어의 일부다.

9. 새로운 문자 시작.